## Plan Result (sbox_shutter_webapp)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;nfdiv&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;nfdiv&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;nfdiv&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;nfdiv&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;nfdiv&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["nfdiv"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["nfdiv"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.nfdiv"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["nfdiv"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nfdiv"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["nfdiv"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "nfdiv.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["nfdiv"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "nfdiv_sbox"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
      + {
          + backend_domain    = [
              + "firewall-sbox-int-palo-cftaat.uksouth.cloudapp.azure.com",
            ]
          + custom_domain     = "nfdiv.sandbox.platform.hmcts.net"
          + disabled_rules    = {
              + LFI  = [
                  + "930100",
                  + "930110",
                ]
              + RCE  = [
                  + "932100",
                ]
              + RFI  = [
                  + "931130",
                ]
              + SQLI = [
                  + "942100",
                  + "942150",
                  + "942200",
                  + "942210",
                  + "942230",
                  + "942361",
                  + "942380",
                  + "942400",
                  + "942430",
                  + "942260",
                ]
            }
          + dns_zone_name     = "sandbox.platform.hmcts.net"
          + global_exclusions = [
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtSa"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "nfdiv-cookie-preferences"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtCookie"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "nfdiv-session"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "lng"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "code"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "client_id"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "iss"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "_csrf"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "applicant1UploadedFiles"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "applicant2UploadedFiles"
                },
            ]
          + mode              = "Prevention"
          + name              = "nfdiv"
        },
        {
            backend_domain   = [
                "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com",
                "lb-sbox-int-plum.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "plum.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "plum"
            product          = "plum"
            shutter_app      = true
        },
        # (1 unchanged element hidden)
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2154,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp","Vars":{}} -->